Revit 2026 API

# NoiseNoiseSize Property

---

The property labeled "Size" from the "Noise" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string NoiseSize { get; }
```
```vb
Public Shared ReadOnly Property NoiseSize As String
	Get
```
```cpp
public:
static property String^ NoiseSize {
	String^ get ();
}
```
```fsharp
static member NoiseSize : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0.001, 10000000000".

#### Reference

Noise Class

Autodesk.Revit.DB.Visual Namespace